GuardianLife/save-request-D2.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:m="http://xmlns.oracle.com/policyautomation/hub/12.2.13/metadata/types" 
    xmlns:r="http://xmlns.oracle.com/connector/webservice/12.2.13/data/types">
    <s:Header>
    </s:Header>
    <s:Body>
        <m:save-request root="Claim" region="en-US" language="en-US" timezone="EST5EDT">
            <m:tables>
                <r:table name="Doctor">
                </r:table>
                <r:table name="Claim">
                    <r:row id="global" action="create">
                        <r:input-field name="isMemberLoggedIn" field-type="boolean">
                            <r:boolean-val>true</r:boolean-val>
                        </r:input-field>
                        <r:input-field name="memberUserId" field-type="text">
                            <r:text-val>555</r:text-val>
                        </r:input-field>
                        <r:input-field name="memberFullName" field-type="text">
                            <r:unknown-val/>
                        </r:input-field>
                        <r:input-field name="selectedProduct" field-type="text">
                            <r:text-val>WEL</r:text-val>
                        </r:input-field>
                        <r:input-field name="cancerClaimType" field-type="text">
                            <r:unknown-val/>
                        </r:input-field>
                        <r:input-field name="memberDivisionId" field-type="text">
                            <r:unknown-val/>
                        </r:input-field>
                        <r:input-field name="memberFirstName" field-type="text">
                            <r:unknown-val/>
                        </r:input-field>
                        <r:input-field name="memberGroupPlanNumber" field-type="text">
                            <r:unknown-val/>
                        </r:input-field>
                        <r:link name="Doctors" target="Doctor">
                        </r:link>
                    </r:row>
                </r:table>
            </m:tables>
            <m:audit-reports>
            </m:audit-reports>
        </m:save-request>
    </s:Body>
</s:Envelope>
